In [2]:
import numpy as np
import pandas as pd

Write a Python program to create and display a onedimensional array-like object containing an array of data using 
Pandas module.

In [2]:
a = pd.array([1,2,3,4,5])
print(a)

<IntegerArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: Int64

Write a Python program to convert a Panda module Series to 
Python list and its type.

In [4]:
a = list(pd.Series([2,3,4,5]))
print(a)
print(type(a))

[2, 3, 4, 5]
<class 'list'>

Write a Python program to add, subtract, multiple and divide 
two Pandas Series

In [8]:
a = pd.Series([1,2,3,4])
b = pd.Series([5,6,7,8])
print(f'Addition: \n{a+b}')
print(f'Subtraction: \n{a-b}')
print(f'Multiplication: \n{a*b}')
print(f'Division: \n{a/b}')

Addition:
0     6
1     8
2    10
3    12
dtype: int64
Subtraction:
0   -4
1   -4
2   -4
3   -4
dtype: int64
Multiplication:
0     5
1    12
2    21
3    32
dtype: int64
Division:
0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

Write a Python program to compare the elements of the two 
Pandas Series

In [10]:
a = pd.Series([1,2,3,4])
b = pd.Series([5,6,7,8])
print(f'less than: \n{a<b}')
print(f'greater than: \n{a>b}')
print(f'equals to: \n{a==b}')

less than:
0    True
1    True
2    True
3    True
dtype: bool
greater than:
0    False
1    False
2    False
3    False
dtype: bool
equals to:
0    False
1    False
2    False
3    False
dtype: bool

Write a Python program to display the following data column 
wise.

In [29]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Marks': [90 , 88 ,75 , 95] ,
       'Grade' : ['A' , 'B' , 'C' , 'A']}
rollno = [1,2,3,4]

df = pd.DataFrame(data , index = rollno)
print(df['Name'])

1       Ankit
2       Akash
3     Abhinav
4    Abhishek
Name: Name, dtype: object

Write a Python program to create and display a Data Frame 
from a specified dictionary data which has the index labels.

In [14]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Marks': [90 , 88 ,75 , 95] ,
       'Grade' : ['A' , 'B' , 'C' , 'A']}
rollno = [1,2,3,4]

df = pd.DataFrame(data , index = rollno)
print(df)

       Name     Dept  Marks Grade
1     Ankit      CSE     90     A
2     Akash       IT     88     B
3   Abhinav    Maths     75     C
4  Abhishek  Science     95     A

Write a Python program to select the specified columns and 
rows from a given Data Frame.

In [25]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Marks': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A']}
rollno = [1,2,3,4]

df = pd.DataFrame(data , index = rollno)
print(df.iloc[[0, 1 ,2],[0,3]])

      Name Grade
1    Ankit     A
2    Akash     B
3  Abhinav     C

Write a Python program to select the rows the score is between 
15 and 20 (inclusive)

In [27]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A']}
rollno = [1,2,3,4]

df = pd.DataFrame(data , index = rollno)
print(df[df['Scores'].between(15,20)])

    Name Dept  Scores Grade
1  Ankit  CSE      15     A
2  Akash   IT      18     B

Write a Python program to select the rows where number of 
attempts in the examination is less than 2 and score greater than 
15

In [7]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A'],
       'Attempts' : [1,2,3,1]}
rollno = [1,2,3,4]

df = pd.DataFrame(data , index = rollno)
print(df[(df['Attempts'] < 2) & (df['Scores'] > 15)])

       Name     Dept  Scores Grade  Attempts
4  Abhishek  Science      21     A         1

Write a Python program to append a new row 'k' to Data Frame 
with given values for each column. Now delete the new row and 
return the original data frame

In [11]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A'],
       'Attempts' : [1,2,3,1]}
label = ['A' , 'B' , 'C' , 'D']

df = pd.DataFrame(data , index = label)
print(df)
df.loc['K'] = ['Avnik' , 'CSE', 20, 'D' , 2] 
print(df)
df = df.drop('K')
print(df)

       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1
       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1
K     Avnik      CSE      20     D         2
       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1

Write a Python program to sort the data frame first by 'name' in 
descending order, then by 'score' in ascending order

In [3]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A'],
       'Attempts' : [1,2,3,1]}
label = ['A' , 'B' , 'C' , 'D']

df = pd.DataFrame(data , index = label)
print(df)

       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1

In [9]:
df.sort_values('Name' , ascending = False).sort_values('Scores')

       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
D  Abhishek  Science      21     A         1
C   Abhinav    Maths      25     C         3

In [8]:
df.sort_values(by = ['Name' , 'Scores'] , ascending = [False , True])

       Name     Dept  Scores Grade  Attempts
A     Ankit      CSE      15     A         1
B     Akash       IT      18     B         2
D  Abhishek  Science      21     A         1
C   Abhinav    Maths      25     C         3

Write a Python program to insert a new column in existing Data
Frame.

In [12]:
data = {'Name': ['Ankit' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A'],
       'Attempts' : [1,2,3,1]}
label = ['A' , 'B' , 'C' , 'D']

df = pd.DataFrame(data , index = label)

df['pass'] = [False , False , True , True]
print(df)

       Name     Dept  Scores Grade  Attempts   pass
A     Ankit      CSE      15     A         1  False
B     Akash       IT      18     B         2  False
C   Abhinav    Maths      25     C         3   True
D  Abhishek  Science      21     A         1   True

Write a Python program to change the name 'James' to 'Suresh' 
in name column of the data frame

In [19]:
data = {'Name': ['James' , 'Akash' , 'Abhinav' , 'Abhishek'] ,
       'Dept': ['CSE' , 'IT' , 'Maths' , 'Science'] ,
       'Scores': [15 , 18 ,25 , 21] ,
       'Grade' : ['A' , 'B' , 'C' , 'A'],
       'Attempts' : [1,2,3,1]}
label = ['A' , 'B' , 'C' , 'D']

df = pd.DataFrame(data , index = label)
print(df)
print('\n')
df['Name'] = df['Name'].replace('James', 'Suresh')
print(df)

       Name     Dept  Scores Grade  Attempts
A     James      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1


       Name     Dept  Scores Grade  Attempts
A    Suresh      CSE      15     A         1
B     Akash       IT      18     B         2
C   Abhinav    Maths      25     C         3
D  Abhishek  Science      21     A         1